docs: setup mermaid
